AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
#include "InterfaceManager.h"
#include "Config.h"
#include "Utils.h"
#include "Log.h"
#include "RoutingTable.h" // Need full definition now for RouteEntry
#include "ReticulumPacket.h" // For MAX_PACKET_SIZE
#include "AX25.h"
#include <WiFi.h>
#include <esp_wifi.h> // For esp_wifi_set_ps
#include <time.h>
#ifdef LORA_ENABLED
#include <SPI.h>
#endif
#ifdef HAM_MODEM_ENABLED
  #ifdef AUDIO_MODEM_ENABLED
    #include "AudioModem.h"
  #endif
  #ifdef WINLINK_ENABLED
    #include "Winlink.h"
  #endif
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#endif

#ifdef IPFS_ENABLED
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#endif

// ESP-NOW broadcast MAC address (FF:FF:FF:FF:FF:FF)
static const uint8_t espnow_broadcast_mac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

// Define static instance pointer
InterfaceManager* InterfaceManager::_instance = nullptr;

InterfaceManager::InterfaceManager(PacketReceiverCallback receiver, RoutingTable& routingTable) :
    _packetReceiver(receiver),
    _routingTableRef(routingTable),
    _espNowInitialized(false),
    // Use lambda to capture 'this' for the member function callback
    _serialKissProcessor([this](const std::vector<uint8_t>& data, InterfaceType iface){ this->handleKissPacket(data, iface); })
#if BLUETOOTH_CLASSIC_AVAILABLE
    , _bluetoothKissProcessor([this](const std::vector<uint8_t>& data, InterfaceType iface){ this->handleKissPacket(data, iface); })
#endif
#ifdef LORA_ENABLED
    , _lora(nullptr), _loraInitialized(false)
#endif
#ifdef HAM_MODEM_ENABLED
    , _hamModemKissProcessor([this](const std::vector<uint8_t>& data, InterfaceType iface){ this->handleKissPacket(data, iface); })
    , _hamModemInitialized(false)
    #ifdef AUDIO_MODEM_ENABLED
    , _audioModem(nullptr)
    #endif
    #ifdef WINLINK_ENABLED
    , _winlink(nullptr)
    #endif
#endif
#ifdef IPFS_ENABLED
    , _ipfsInitialized(false)
#endif
{
    if (_instance != nullptr) {
         // This should not happen if InterfaceManager is instantiated only once by ReticulumNode
         DebugSerial.println("! FATAL: Multiple InterfaceManager instances detected!");
         // Handle error: abort?
         return;
    }
    _instance = this; // Set the static instance pointer
}

void InterfaceManager::setup() {
    setupSerial(); // Assumes Serial.begin() already called

    // Initialize Bluetooth first (if available)
#if BLUETOOTH_CLASSIC_AVAILABLE
    setupBluetooth();
#endif
    
    // Always start WiFi radio (needed for ESP-NOW even without AP connection)
    setupWiFi();
    setupESPNow();
    
#ifdef LORA_ENABLED
    setupLoRa();
#endif

#ifdef HAM_MODEM_ENABLED
    setupHAMModem();
#endif

#ifdef IPFS_ENABLED
    setupIPFS();
#endif
    
    DebugSerial.println("Interface Manager Setup Complete.");
}

void InterfaceManager::loop() {
    cleanupExpiredEspNowAssemblies();

    // Process inputs from KISS interfaces
    processSerialInput();
#if BLUETOOTH_CLASSIC_AVAILABLE
    processBluetoothInput();
#endif

    // Process UDP input if WiFi is connected
    if (WiFi.status() == WL_CONNECTED) {
        processWiFiInput();
    }

#ifdef LORA_ENABLED
    processLoRaInput();
#endif

#ifdef HAM_MODEM_ENABLED
    processHAMModemInput();
#endif

#if defined(HAM_MODEM_ENABLED) && defined(AUDIO_MODEM_ENABLED)
    pollAX25FromAudioModem();
#endif
}

void InterfaceManager::setupSerial() {
    // KissSerial is started in main.cpp for KISS interface
    LOG_INFO("IF: KISS Serial interface ready (RX=%d, TX=%d, baud=%d).", KISS_UART_RX, KISS_UART_TX, KISS_SERIAL_SPEED);
}

void InterfaceManager::setupWiFi() {
    WiFi.disconnect(true);  // Disconnect and turn off WiFi
    WiFi.mode(WIFI_OFF);   // Ensure WiFi is off before reconfiguring
    delay(100);            // Small delay to ensure WiFi is fully off
    
    // STA mode is required for ESP-NOW — always enable it
    WiFi.mode(WIFI_STA);
    // ESP-NOW is latency-sensitive; modem sleep can drop/delay frames.
    esp_wifi_set_ps(WIFI_PS_NONE);

    // Only attempt AP connection if explicitly enabled and credentials are provided.
    if (WIFI_STA_CONNECT_ENABLED && strlen(WIFI_SSID) > 0 && strlen(WIFI_PASSWORD) > 0) {
        WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
        LOG_INFO("IF: Connecting to WiFi %s", WIFI_SSID);
        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 20) {
            delay(500); DebugSerial.print("."); attempts++;
        }
        if (WiFi.status() == WL_CONNECTED) {
            LOG_INFO("IF: WiFi connected.");
            LOG_INFO("IF: IP address: %s", WiFi.localIP().toString().c_str());
            setenv("TZ", "UTC0", 1);
            tzset();
            configTime(0, 0, "pool.ntp.org", "time.nist.gov", "time.google.com");
            if (_udp.begin(RNS_UDP_PORT)) {
                DebugSerial.print("IF: UDP Listening on port "); DebugSerial.println(RNS_UDP_PORT);
            } else {
                DebugSerial.println("! ERROR: Failed to start UDP listener!");
            }
        } else {
            LOG_WARN("IF: WiFi connection failed after %d attempts.", attempts);
        }
    } else {
        if (!WIFI_STA_CONNECT_ENABLED) {
            LOG_INFO("IF: AP connection disabled (WIFI_STA_CONNECT_ENABLED=0). Running ESP-NOW-only mode.");
        } else {
            LOG_INFO("IF: No WiFi credentials configured, skipping AP connection.");
        }
        LOG_INFO("IF: WiFi radio active in STA mode for ESP-NOW.");
    }
}

void InterfaceManager::setupESPNow() {
     DebugSerial.print("IF: Device MAC: "); DebugSerial.println(WiFi.macAddress());

    // Optional channel override
    if (ESP_NOW_CHANNEL != 0) {
        esp_err_t ch_err = esp_wifi_set_channel(ESP_NOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
        if (ch_err == ESP_OK) {
            DebugSerial.print("IF: Forced WiFi channel to "); DebugSerial.println(ESP_NOW_CHANNEL);
        } else {
            DebugSerial.print("! WARN: Failed to set WiFi channel: "); DebugSerial.println(esp_err_to_name(ch_err));
        }
    } else {
        DebugSerial.println("IF: ESP-NOW channel follows connected AP channel (ESP_NOW_CHANNEL=0).");
    }

    // Query current channel for debugging
    uint8_t curr_ch;
    wifi_second_chan_t second_ch;
    esp_wifi_get_channel(&curr_ch, &second_ch);
    DebugSerial.print("IF: Current WiFi channel: "); DebugSerial.println(curr_ch);

