AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
    if (esp_now_init() != ESP_OK) {
        DebugSerial.println("! ERROR: Initializing ESP-NOW failed!");
        return; // Cannot proceed with ESP-NOW
    }
    // Register static callback function which calls instance method
    esp_err_t result = esp_now_register_recv_cb(staticEspNowRecvCallback);
    if (result != ESP_OK) {
         DebugSerial.print("! ERROR: Failed to register ESP-NOW recv cb: "); DebugSerial.println(esp_err_to_name(result));
    }
    // esp_now_register_send_cb(staticEspNowSendCallback); // Optional: register send status callback

    _espNowInitialized = true;

    // Add broadcast peer initially (needed to receive broadcasts)
    if (!addEspNowPeer(espnow_broadcast_mac)) {
         DebugSerial.println("! WARN: Failed to add initial ESP-NOW broadcast peer");
    }
    DebugSerial.println("IF: ESP-NOW Initialized.");
}

#if BLUETOOTH_CLASSIC_AVAILABLE
void InterfaceManager::setupBluetooth() {
     if (!_serialBT.begin(BT_DEVICE_NAME)) {
         DebugSerial.println("! ERROR: Bluetooth Serial initialization failed!");
     } else {
        DebugSerial.print("IF: Bluetooth ready. Device Name: ");
        DebugSerial.println(BT_DEVICE_NAME);
    }
}
#endif

// --- Input Processing ---
void InterfaceManager::processWiFiInput() {
    if (WiFi.status() != WL_CONNECTED) return;
    int packetSize = _udp.parsePacket();
    if (packetSize > 0) {
        if (packetSize > MAX_PACKET_SIZE) {
             DebugSerial.print("! WARN: Oversized UDP packet received ("); DebugSerial.print(packetSize); DebugSerial.println(" bytes), discarding.");
             _udp.flush(); // Discard data
             return;
        }

        // Use unique_ptr for automatic memory management
        std::unique_ptr<uint8_t[]> udpBuffer(new (std::nothrow) uint8_t[packetSize]);
        if (!udpBuffer) {
             LOG_ERROR("new failed for UDP buffer!");
             _udp.flush();
             return;
        }

        int len = _udp.read(udpBuffer.get(), packetSize);
        if (len > 0 && _packetReceiver) {
            _packetReceiver(udpBuffer.get(), len, InterfaceType::WIFI_UDP, nullptr, _udp.remoteIP(), _udp.remotePort());
        }
    }
}

void InterfaceManager::processSerialInput() {
     while (KissSerial.available()) {
        _serialKissProcessor.decodeByte(KissSerial.read(), InterfaceType::SERIAL_PORT);
    }
}

#if BLUETOOTH_CLASSIC_AVAILABLE
void InterfaceManager::processBluetoothInput() {
     while (_serialBT.available()) {
         _bluetoothKissProcessor.decodeByte(_serialBT.read(), InterfaceType::BLUETOOTH);
    }
}
#endif

// --- KISS Packet Handling ---
void InterfaceManager::handleKissPacket(const std::vector<uint8_t>& packetData, InterfaceType interface) {
     // Debug: Print raw received packet
     DebugSerial.print("[KISS] Received ");
     DebugSerial.print(packetData.size());
     DebugSerial.print(" bytes on interface ");
     DebugSerial.print(static_cast<int>(interface));
     DebugSerial.print(": ");
     for (size_t i = 0; i < min(packetData.size(), (size_t)20); i++) {
         if (packetData[i] < 0x10) DebugSerial.print("0");
         DebugSerial.print(packetData[i], HEX);
         DebugSerial.print(" ");
     }
     if (packetData.size() > 20) DebugSerial.print("...");
     DebugSerial.println();

     if (_packetReceiver) {
         // Pass received packet up to ReticulumNode, indicate no specific sender MAC/IP/Port
         _packetReceiver(packetData.data(), packetData.size(), interface, nullptr, IPAddress(), 0);
     }
}


// --- Sending Logic ---
void InterfaceManager::sendPacket(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr, InterfaceType excludeInterface) {
    if (!packetBuffer || packetLen == 0) return;

    // Determine target interface(s) based on routing (or broadcast if unknown)
    RouteEntry* route = _routingTableRef.findRoute(destinationAddr);

    // Send via specific interface if route found, otherwise broadcast on relevant interfaces
    if (route) {
        if (route->interface != excludeInterface) {
             // Send only via the routed interface
             sendPacketVia(route->interface, packetBuffer, packetLen, destinationAddr);
        }
    } else {
        // No route, broadcast on primary interfaces (excluding source)
        // DebugSerial.print("Broadcasting packet (no route found) for dest: "); Utils::printBytes(destinationAddr, RNS_ADDRESS_SIZE, DebugSerial); DebugSerial.println(); // Verbose
        if (_espNowInitialized && excludeInterface != InterfaceType::ESP_NOW) {
            sendPacketViaEspNow(packetBuffer, packetLen, nullptr); // Broadcast = null dest for internal func
        }
        if (WiFi.status() == WL_CONNECTED && excludeInterface != InterfaceType::WIFI_UDP) {
             sendPacketViaWiFi(packetBuffer, packetLen, nullptr); // Broadcast = null dest for internal func
        }
#ifdef LORA_ENABLED
        if (_loraInitialized && excludeInterface != InterfaceType::LORA) {
            sendPacketViaLoRa(packetBuffer, packetLen, nullptr);
        }
#endif
        // Bridge packets to serial KISS (USB) so the host receives them
        if (excludeInterface != InterfaceType::SERIAL_PORT) { sendPacketViaSerial(packetBuffer, packetLen); }
#if BLUETOOTH_CLASSIC_AVAILABLE
        // if (_serialBT.connected() && excludeInterface != InterfaceType::BLUETOOTH) { sendPacketViaBluetooth(packetBuffer, packetLen); }
#endif
    }
}

void InterfaceManager::sendPacketVia(InterfaceType ifType, const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr) {
     if (!packetBuffer || packetLen == 0) return;
     switch(ifType) {
        case InterfaceType::ESP_NOW:  if (_espNowInitialized) sendPacketViaEspNow(packetBuffer, packetLen, destinationAddr); break;
        case InterfaceType::WIFI_UDP: if (WiFi.status() == WL_CONNECTED) sendPacketViaWiFi(packetBuffer, packetLen, destinationAddr); break;
        case InterfaceType::SERIAL_PORT:   sendPacketViaSerial(packetBuffer, packetLen); break;
#if BLUETOOTH_CLASSIC_AVAILABLE
        case InterfaceType::BLUETOOTH:sendPacketViaBluetooth(packetBuffer, packetLen); break;
#endif
#ifdef LORA_ENABLED
        case InterfaceType::LORA: sendPacketViaLoRa(packetBuffer, packetLen, destinationAddr); break;
#endif
#ifdef HAM_MODEM_ENABLED
        case InterfaceType::HAM_MODEM: sendPacketViaHAMModem(packetBuffer, packetLen); break;
#endif
#ifdef IPFS_ENABLED
        case InterfaceType::IPFS: sendPacketViaIPFS(packetBuffer, packetLen, destinationAddr); break;
#endif
        default: DebugSerial.print("! WARN: sendPacketVia unsupported interface: "); DebugSerial.println(static_cast<int>(ifType)); break;
     }
}

void InterfaceManager::broadcastAnnounce(const uint8_t *packetBuffer, size_t packetLen) {
     if (!packetBuffer || packetLen == 0) return;
     // Use nullptr destination for broadcast variants
     if (_espNowInitialized) {
         sendPacketViaEspNow(packetBuffer, packetLen, nullptr);
     }
     if (WiFi.status() == WL_CONNECTED) {
         sendPacketViaWiFi(packetBuffer, packetLen, nullptr);
     }
#ifdef LORA_ENABLED
     if (_loraInitialized) {
         sendPacketViaLoRa(packetBuffer, packetLen, nullptr);
     }
#endif
#ifdef HAM_MODEM_ENABLED
     if (_hamModemInitialized) {
         sendPacketViaHAMModem(packetBuffer, packetLen);
     }
#endif
     // Always send announces via serial KISS (USB/UART)
     sendPacketViaSerial(packetBuffer, packetLen);
}

// Internal send implementations
void InterfaceManager::sendPacketViaEspNow(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr) {
    const uint8_t* targetMac = espnow_broadcast_mac; // Default to broadcast
    RouteEntry* route = nullptr;

#if ESP_NOW_INDISCRIMINATE_BROADCAST
    (void)destinationAddr;
#else
    if (destinationAddr != nullptr) { // If destination provided, try to find route
        route = _routingTableRef.findRoute(destinationAddr);
         if (route && route->interface == InterfaceType::ESP_NOW) {
             targetMac = route->next_hop_mac;
             // Ensure peer exists - crucial for direct send
             if (!checkEspNowPeer(targetMac)) {
                 if (!addEspNowPeer(targetMac)) {
                     targetMac = espnow_broadcast_mac; // Fallback if add fails
                 }
             }
         } else { targetMac = espnow_broadcast_mac; } // No route / wrong interface
    } // else: destinationAddr is null -> use broadcastMac
#endif

    if (packetLen <= ESPNOW_MAX_PAYLOAD_LEN) {
        esp_err_t result = esp_now_send(targetMac, packetBuffer, packetLen);
        if (result != ESP_OK) {
            if (result == ESP_ERR_ESPNOW_NO_MEM) {
                DebugSerial.println("! ESP-NOW send out of memory for small packet");
            } else {
                DebugSerial.print("! ESP-NOW Send Error to "); Utils::printBytes(targetMac, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(result));
            }
        }
        return;
    }

    const size_t maxChunk = ESPNOW_FRAG_CHUNK_DATA_LEN;
    const size_t totalChunksSz = (packetLen + maxChunk - 1) / maxChunk;
    if (totalChunksSz == 0 || totalChunksSz > 255) {
        DebugSerial.print("! ESP-NOW fragmentation failed, packet too large for chunk count: ");
        DebugSerial.println(packetLen);
        return;
    }

    const uint8_t totalChunks = static_cast<uint8_t>(totalChunksSz);
    _espNowTxMessageId++;
    if (_espNowTxMessageId == 0) {
        _espNowTxMessageId = 1;
    }
    const uint16_t messageId = _espNowTxMessageId;

    for (uint8_t chunkIndex = 0; chunkIndex < totalChunks; ++chunkIndex) {
        const size_t offset = static_cast<size_t>(chunkIndex) * maxChunk;
        const size_t remaining = packetLen - offset;
        const size_t chunkLen = remaining > maxChunk ? maxChunk : remaining;

