AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
        uint8_t frame[ESPNOW_MAX_PAYLOAD_LEN];
        frame[0] = ESPNOW_FRAG_MAGIC0;
        frame[1] = ESPNOW_FRAG_MAGIC1;
        frame[2] = ESPNOW_FRAG_VERSION;
        frame[3] = static_cast<uint8_t>((messageId >> 8) & 0xFF);
        frame[4] = static_cast<uint8_t>(messageId & 0xFF);
        frame[5] = chunkIndex;
        frame[6] = totalChunks;
        frame[7] = 0;
        memcpy(frame + ESPNOW_FRAG_HEADER_LEN, packetBuffer + offset, chunkLen);

        esp_err_t result = esp_now_send(targetMac, frame, ESPNOW_FRAG_HEADER_LEN + chunkLen);
        if (result != ESP_OK) {
            DebugSerial.print("! ESP-NOW fragment send failed (msg=");
            DebugSerial.print(messageId);
            DebugSerial.print(", chunk=");
            DebugSerial.print(chunkIndex);
            DebugSerial.print("/");
            DebugSerial.print(totalChunks);
            DebugSerial.print("): ");
            DebugSerial.println(esp_err_to_name(result));
            return;
        }
    }
}

void InterfaceManager::sendPacketViaWiFi(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr) {
     if (WiFi.status() != WL_CONNECTED) return;

    IPAddress targetIp;
    uint16_t targetPort = RNS_UDP_PORT;
    IPAddress broadcastIp = WiFi.broadcastIP();
    targetIp = broadcastIp; // Default to broadcast

     if (destinationAddr != nullptr) { // If destination provided, try to find route
        RouteEntry* route = _routingTableRef.findRoute(destinationAddr);
        if (route && route->interface == InterfaceType::WIFI_UDP && route->next_hop_ip) {
            targetIp = route->next_hop_ip;
            // targetPort = route->next_hop_port; // Use standard port
        } // else: use broadcast IP
     } // else: destinationAddr is null -> use broadcast IP

    if (!targetIp || targetIp == INADDR_NONE) {
        DebugSerial.println("! WARN: UDP Target IP is invalid, cannot send.");
        return;
    }

    _udp.beginPacket(targetIp, targetPort);
    size_t sent = _udp.write(packetBuffer, packetLen);
    if (sent != packetLen) { DebugSerial.print("! WARN: UDP write incomplete (sent "); DebugSerial.print(sent); DebugSerial.print("/"); DebugSerial.print(packetLen); DebugSerial.println(" bytes)"); }
    if (!_udp.endPacket()) { DebugSerial.println("! ERROR: UDP endPacket failed!"); }
}

#if METRICS_ENABLED && METRICS_UDP_ENABLED
void InterfaceManager::sendUdpMetrics(const String &json) {
    if (WiFi.status() != WL_CONNECTED) return;
    IPAddress bcast = WiFi.broadcastIP();
    if (!bcast || bcast == INADDR_NONE) return;
    _udp.beginPacket(bcast, METRICS_UDP_PORT);
    _udp.print(json);
    _udp.endPacket();
    LOG_DEBUG("UDP metrics sent to %s:%u", bcast.toString().c_str(), METRICS_UDP_PORT);
}
#endif

// KISS interface sends packaets over dedicated serial link
void InterfaceManager::sendPacketViaSerial(const uint8_t *packetBuffer, size_t packetLen) {
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(packetBuffer, packetLen, kissEncoded);
    (void)KissSerial.write(kissEncoded.data(), kissEncoded.size()); // ignore return value
    // if(sent != kissEncoded.size()) { DebugSerial.println("! WARN: Serial write incomplete"); } // Optional check
}
#if BLUETOOTH_CLASSIC_AVAILABLE
void InterfaceManager::sendPacketViaBluetooth(const uint8_t *packetBuffer, size_t packetLen) {
    if (!_serialBT.connected()) return;
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(packetBuffer, packetLen, kissEncoded);
    size_t sent = _serialBT.write(kissEncoded.data(), kissEncoded.size());
     // if(sent != kissEncoded.size()) { DebugSerial.println("! WARN: Bluetooth write incomplete"); } // Optional check
}
#endif

// --- ESP-NOW Peer Management ---
void InterfaceManager::enableEspNow() {
    if (_espNowInitialized) {
        DebugSerial.println("IF: ESP-NOW already enabled.");
        return;
    }
    // Ensure WiFi radio is in STA mode
    if (WiFi.getMode() == WIFI_OFF) {
        WiFi.mode(WIFI_STA);
        esp_wifi_set_ps(WIFI_PS_NONE);
    }
    setupESPNow();
}

void InterfaceManager::disableEspNow() {
    if (!_espNowInitialized) {
        DebugSerial.println("IF: ESP-NOW already disabled.");
        return;
    }
    esp_now_deinit();
    _espNowPeers.clear();
    _espNowInitialized = false;
    DebugSerial.println("IF: ESP-NOW disabled.");
}

bool InterfaceManager::addEspNowPeer(const uint8_t* mac_addr) {
    if (!mac_addr || !_espNowInitialized) return false;
    if (checkEspNowPeer(mac_addr)) {
        // ensure our list also contains it
        std::array<uint8_t,6> arr;
        memcpy(arr.data(), mac_addr, 6);
        if (std::find(_espNowPeers.begin(), _espNowPeers.end(), arr) == _espNowPeers.end()) {
            _espNowPeers.push_back(arr);
        }
        return true; // Already exists at driver level
    }

    esp_now_peer_info_t peerInfo = {}; // Initialize all fields to 0/false/etc.
    memcpy(peerInfo.peer_addr, mac_addr, 6);
    // peerInfo.channel = 0; // Use current channel by default
    peerInfo.encrypt = false; // Encryption disabled (requires shared keys)
    // Try adding peer. On some IDF/Arduino builds the driver requires the ifidx
    // (station vs softAP) to be set. Try without ifidx first, then retry with
    // WIFI_IF_STA if the first attempt fails.
    esp_err_t add_result = esp_now_add_peer(&peerInfo);
    if (add_result != ESP_OK) {
         DebugSerial.print("! WARN: esp_now_add_peer() initial attempt failed for "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(add_result));
         // Retry with explicit interface index
         peerInfo.ifidx = WIFI_IF_STA;
         add_result = esp_now_add_peer(&peerInfo);
         if (add_result != ESP_OK) {
             DebugSerial.print("! ERROR: Failed to add ESP-NOW peer after retry "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(add_result));
             return false;
         } else {
             DebugSerial.println("IF: esp_now_add_peer succeeded on retry with WIFI_IF_STA");
         }
    }
    DebugSerial.print("IF: Added ESP-NOW peer: "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.println();
    // record in our local list
    {
        std::array<uint8_t,6> arr;
        memcpy(arr.data(), mac_addr, 6);
        _espNowPeers.push_back(arr);
    }
    return true;
}

bool InterfaceManager::removeEspNowPeer(const uint8_t* mac_addr) {
     if (!mac_addr || !_espNowInitialized) return false;
     if (!checkEspNowPeer(mac_addr)) return false; // Not found

     esp_err_t del_result = esp_now_del_peer(mac_addr);
     if (del_result != ESP_OK) {
         DebugSerial.print("! WARN: Failed to delete ESP-NOW peer "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(del_result));
         return false;
     }
     DebugSerial.print("IF: Removed ESP-NOW peer: "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.println();
     // remove from our vector as well
     std::array<uint8_t,6> arr;
     memcpy(arr.data(), mac_addr, 6);
     auto it = std::find(_espNowPeers.begin(), _espNowPeers.end(), arr);
     if (it != _espNowPeers.end()) _espNowPeers.erase(it);
     return true;
}

bool InterfaceManager::checkEspNowPeer(const uint8_t* mac_addr) {
    if (!mac_addr || !_espNowInitialized) return false;
    // esp_now_is_peer_exist() is deprecated/removed in later IDF versions.
    // Use esp_now_get_peer() and check result.
    esp_now_peer_info_t peer_info;
    return (esp_now_get_peer(mac_addr, &peer_info) == ESP_OK);
    // return esp_now_is_peer_exist(mac_addr); // Older IDF versions
}

bool InterfaceManager::parseEspNowFragment(const uint8_t *data, int len, uint16_t &messageId, uint8_t &chunkIndex, uint8_t &totalChunks, const uint8_t* &chunkData, size_t &chunkLen) const {
    if (!data || len <= 0) return false;
    if (len < static_cast<int>(ESPNOW_FRAG_HEADER_LEN)) return false;
    if (data[0] != ESPNOW_FRAG_MAGIC0 || data[1] != ESPNOW_FRAG_MAGIC1 || data[2] != ESPNOW_FRAG_VERSION) return false;

