AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
    messageId = (static_cast<uint16_t>(data[3]) << 8) | static_cast<uint16_t>(data[4]);
    chunkIndex = data[5];
    totalChunks = data[6];
    if (totalChunks == 0 || chunkIndex >= totalChunks) return false;

    chunkData = data + ESPNOW_FRAG_HEADER_LEN;
    chunkLen = static_cast<size_t>(len) - ESPNOW_FRAG_HEADER_LEN;
    return true;
}

InterfaceManager::EspNowRxAssembly* InterfaceManager::getEspNowAssemblySlot(const uint8_t *senderMac, uint16_t messageId, uint8_t totalChunks) {
    if (!senderMac || totalChunks == 0) return nullptr;

    for (auto &slot : _espNowRxAssemblies) {
        if (slot.active && slot.messageId == messageId && slot.totalChunks == totalChunks && memcmp(slot.senderMac.data(), senderMac, 6) == 0) {
            return &slot;
        }
    }

    for (auto &slot : _espNowRxAssemblies) {
        if (!slot.active) {
            slot.active = true;
            memcpy(slot.senderMac.data(), senderMac, 6);
            slot.messageId = messageId;
            slot.totalChunks = totalChunks;
            slot.lastUpdateMs = millis();
            slot.chunks.assign(totalChunks, std::vector<uint8_t>());
            slot.receivedChunk.assign(totalChunks, 0);
            slot.receivedCount = 0;
            return &slot;
        }
    }

    if (_espNowRxAssemblies.size() < ESPNOW_MAX_RX_ASSEMBLIES) {
        EspNowRxAssembly slot;
        slot.active = true;
        memcpy(slot.senderMac.data(), senderMac, 6);
        slot.messageId = messageId;
        slot.totalChunks = totalChunks;
        slot.lastUpdateMs = millis();
        slot.chunks.assign(totalChunks, std::vector<uint8_t>());
        slot.receivedChunk.assign(totalChunks, 0);
        _espNowRxAssemblies.push_back(slot);
        return &_espNowRxAssemblies.back();
    }

    size_t oldestIndex = 0;
    unsigned long oldestTime = _espNowRxAssemblies[0].lastUpdateMs;
    for (size_t i = 1; i < _espNowRxAssemblies.size(); ++i) {
        if (_espNowRxAssemblies[i].lastUpdateMs < oldestTime) {
            oldestTime = _espNowRxAssemblies[i].lastUpdateMs;
            oldestIndex = i;
        }
    }

    auto &slot = _espNowRxAssemblies[oldestIndex];
    slot.active = true;
    memcpy(slot.senderMac.data(), senderMac, 6);
    slot.messageId = messageId;
    slot.totalChunks = totalChunks;
    slot.lastUpdateMs = millis();
    slot.chunks.assign(totalChunks, std::vector<uint8_t>());
    slot.receivedChunk.assign(totalChunks, 0);
    slot.receivedCount = 0;
    return &slot;
}

void InterfaceManager::handleEspNowPayload(const uint8_t *senderMac, const uint8_t *incomingData, int len) {
    if (!_packetReceiver || !senderMac || !incomingData || len <= 0) return;

    uint16_t messageId = 0;
    uint8_t chunkIndex = 0;
    uint8_t totalChunks = 0;
    const uint8_t *chunkData = nullptr;
    size_t chunkLen = 0;

    if (!parseEspNowFragment(incomingData, len, messageId, chunkIndex, totalChunks, chunkData, chunkLen)) {
        if (len <= static_cast<int>(MAX_PACKET_SIZE)) {
            _packetReceiver(incomingData, static_cast<size_t>(len), InterfaceType::ESP_NOW, senderMac, IPAddress(), 0);
        } else {
            DebugSerial.print("! WARN: Oversized raw ESP-NOW payload (");
            DebugSerial.print(len);
            DebugSerial.println(") discarded.");
        }
        return;
    }

    if (totalChunks == 1) {
        if (chunkLen <= MAX_PACKET_SIZE) {
            _packetReceiver(chunkData, chunkLen, InterfaceType::ESP_NOW, senderMac, IPAddress(), 0);
        }
        return;
    }

    EspNowRxAssembly *slot = getEspNowAssemblySlot(senderMac, messageId, totalChunks);
    if (!slot) return;

    if (chunkIndex >= slot->receivedChunk.size()) return;
    if (!slot->receivedChunk[chunkIndex]) {
        slot->receivedChunk[chunkIndex] = 1;
        slot->receivedCount++;
        size_t currentLen = 0;
        for (const auto &chunk : slot->chunks) {
            currentLen += chunk.size();
        }
        if (currentLen + chunkLen > MAX_PACKET_SIZE) {
            slot->active = false;
            slot->chunks.clear();
            slot->receivedChunk.clear();
            slot->receivedCount = 0;
            DebugSerial.println("! WARN: ESP-NOW reassembly exceeded MAX_PACKET_SIZE, dropped frame");
            return;
        }
        slot->chunks[chunkIndex].assign(chunkData, chunkData + chunkLen);
    }
    slot->lastUpdateMs = millis();

    if (slot->receivedCount == slot->totalChunks) {
        std::vector<uint8_t> assembled;
        assembled.reserve(MAX_PACKET_SIZE);
        for (const auto &chunk : slot->chunks) {
            assembled.insert(assembled.end(), chunk.begin(), chunk.end());
        }
        _packetReceiver(assembled.data(), assembled.size(), InterfaceType::ESP_NOW, senderMac, IPAddress(), 0);
        slot->active = false;
        slot->chunks.clear();
        slot->receivedChunk.clear();
        slot->receivedCount = 0;
    }
}

void InterfaceManager::cleanupExpiredEspNowAssemblies() {
    const unsigned long now = millis();
    for (auto &slot : _espNowRxAssemblies) {
        if (slot.active && (now - slot.lastUpdateMs) > ESPNOW_REASSEMBLY_TIMEOUT_MS) {
            slot.active = false;
            slot.chunks.clear();
            slot.receivedChunk.clear();
            slot.receivedCount = 0;
        }
    }
}


// --- Debug Helpers ---
void InterfaceManager::printEspNowPeers() {
    DebugSerial.println("IF: ESP-NOW peer list:");
    if (_espNowPeers.empty()) {
        DebugSerial.println("  (none)");
        return;
    }
    for (const auto &addr : _espNowPeers) {
        DebugSerial.print("  "); Utils::printBytes(addr.data(), 6, DebugSerial); DebugSerial.println();
    }
}

// --- Static Callbacks ---
// ESP-IDF v5 changed the callback signature to esp_now_recv_info_t.
#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
void InterfaceManager::staticEspNowRecvCallback(const esp_now_recv_info_t *recv_info, const uint8_t *incomingData, int len) {
    const uint8_t* mac_addr = (recv_info != nullptr) ? recv_info->src_addr : nullptr;
#else
void InterfaceManager::staticEspNowRecvCallback(const uint8_t *mac_addr, const uint8_t *incomingData, int len) {
#endif
    if (_instance && _instance->_packetReceiver && mac_addr && incomingData && len > 0) {
         DebugSerial.print("[ESP-NOW RX] "); DebugSerial.print(len); DebugSerial.print("B from ");
         Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.println();
         _instance->handleEspNowPayload(mac_addr, incomingData, len);
    }
}

/* Optional Static Send Callback
void InterfaceManager::staticEspNowSendCallback(const uint8_t *mac_addr, esp_now_send_status_t status) {
    if (_instance && mac_addr) {
        // Could notify routing table or link manager about send status
        // DebugSerial.print("IF: ESP-NOW Send Status to MAC "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(status == ESP_NOW_SEND_SUCCESS ? "Success" : "Fail");
    }
}
*/

