AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
    DebugSerial.print("IF: Publishing to IPFS via local node: ");
    DebugSerial.println(url);

    // Boundary for multipart form
    const String boundary = "----ESP32IPFSBoundary";
    const String contentType = "multipart/form-data; boundary=" + boundary;

    // Construct multipart body: --boundary\r\n headers \r\n\r\n <data> \r\n--boundary--\r\n
    String prefix = "--" + boundary + "\r\n";
    prefix += "Content-Disposition: form-data; name=\"file\"; filename=\"data.bin\"\r\n";
    prefix += "Content-Type: application/octet-stream\r\n\r\n";
    String suffix = "\r\n--" + boundary + "--\r\n";

    std::vector<uint8_t> body;
    body.reserve(prefix.length() + len + suffix.length());
    body.insert(body.end(), prefix.begin(), prefix.end());
    body.insert(body.end(), data, data + len);
    body.insert(body.end(), suffix.begin(), suffix.end());

    _httpClient.begin(url);
    _httpClient.setTimeout(IPFS_PUBLISH_TIMEOUT_MS);
    _httpClient.addHeader("Content-Type", contentType);

    int httpCode = _httpClient.POST(body.data(), body.size());

    if (httpCode == HTTP_CODE_OK) {
        String response = _httpClient.getString();

        // Parse JSON response to extract hash
        // Response format: {"Name":"data.bin","Hash":"Qm...","Size":"123"}
        int hashStart = response.indexOf("\"Hash\":\"");
        if (hashStart >= 0) {
            hashStart += 8;
            int hashEnd = response.indexOf("\"", hashStart);
            if (hashEnd > hashStart) {
                ipfsHash = response.substring(hashStart, hashEnd);
                _httpClient.end();
                DebugSerial.print("IF: IPFS content published, hash: ");
                DebugSerial.println(ipfsHash);
                return true;
            }
        }
        _httpClient.end();
        DebugSerial.println("! ERROR: Failed to parse IPFS response");
        return false;
    } else {
        DebugSerial.print("! ERROR: IPFS publish failed, HTTP code: ");
        DebugSerial.println(httpCode);
        _httpClient.end();
        return false;
    }
#else
    // No local node - suggest alternatives
    DebugSerial.println("! WARN: IPFS local node not enabled.");
    DebugSerial.println("! INFO: Set IPFS_LOCAL_NODE_ENABLED to 1 in Config.h");
    DebugSerial.println("! INFO: Or use a pinning service (Pinata, Infura, etc.)");
    return false;
#endif
}

void InterfaceManager::sendPacketViaIPFS(const uint8_t *packetBuffer, size_t packetLen, const uint8_t *destinationAddr) {
    if (!_ipfsInitialized) {
        DebugSerial.println("! WARN: IPFS not initialized, cannot send packet");
        return;
    }

    String ipfsHash;
    if (!publishToIPFS(packetBuffer, packetLen, ipfsHash)) {
        DebugSerial.println("! ERROR: Failed to publish packet to IPFS");
        return;
    }
    if (ipfsHash.length() == 0) {
        DebugSerial.println("! ERROR: IPFS hash is empty");
        return;
    }

    RnsPacketInfo info;
    bool parsed = ReticulumPacket::deserialize(packetBuffer, packetLen, info);

    uint8_t destHash[16] = {0};
    if (parsed) {
        memcpy(destHash, info.destination_hash, sizeof(destHash));
    } else if (destinationAddr) {
        memcpy(destHash, destinationAddr, RNS_ADDRESS_SIZE);
    }

    const String reference = String("ipfs:") + ipfsHash;
    std::vector<uint8_t> payload(reference.begin(), reference.end());
    if (payload.size() > RNS_MAX_PAYLOAD) {
        DebugSerial.println("! ERROR: IPFS reference payload too large");
        return;
    }

    uint8_t refBuffer[MAX_PACKET_SIZE];
    size_t refLen = 0;
    const uint8_t packetType = parsed ? info.packet_type : RNS_PACKET_DATA;
    const uint8_t destType = parsed ? info.destination_type : RNS_DEST_PLAIN;
    const uint8_t propagationType = parsed ? info.propagation_type : RNS_PROPAGATION_BROADCAST;
    const uint8_t context = parsed ? info.context : RNS_CONTEXT_NONE;
    const uint8_t hops = parsed ? info.hops : 0;

    if (!ReticulumPacket::serialize(refBuffer, refLen, destHash, packetType, destType, propagationType, context, hops, payload)) {
        DebugSerial.println("! ERROR: Failed to serialize IPFS reference packet");
        return;
    }

    RouteEntry* route = nullptr;
    if (destinationAddr) {
        route = _routingTableRef.findRoute(destinationAddr);
    }

    if (route && route->interface != InterfaceType::IPFS) {
        sendPacketVia(route->interface, refBuffer, refLen, destinationAddr);
        return;
    }

    if (destinationAddr == nullptr || !route || route->interface == InterfaceType::IPFS) {
        sendPacketViaEspNow(refBuffer, refLen, destinationAddr);
        if (WiFi.status() == WL_CONNECTED) {
            sendPacketViaWiFi(refBuffer, refLen, destinationAddr);
        }
#ifdef LORA_ENABLED
        if (_loraInitialized) {
            sendPacketViaLoRa(refBuffer, refLen, destinationAddr);
        }
#endif
#ifdef HAM_MODEM_ENABLED
        if (_hamModemInitialized) {
            sendPacketViaHAMModem(refBuffer, refLen);
        }
#endif
    }
}
#endif
